Управление_закупками/src/Tasks/ЗадачиИсполнителейОМТС/ЗадачиИсполнителейОМТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачиИсполнителейОМТС</name>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Замечания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеХарактеристикиНоменклатуры</name>
      <type>
        <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ПринятоВРаботу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

Управление_закупками/src/InformationRegisters/РаспределениеПоИсполнителямОМТС/РаспределениеПоИсполнителямОМТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаспределениеПоИсполнителямОМТС</name>
  <resources>
    <name>СотрудникОМТС</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныеХарактеристикиНоменклатуры</name>
    <type>
      <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_закупками/src/Documents/ВнутреннийЗаказ/ВнутреннийЗаказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннийЗаказ</name>
  <registerRecords>AccumulationRegister.ОстатокПотребностиПоВнутреннимЗаказам</registerRecords>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоставки</name>
    <type>
      <types>EnumRef.ВидПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяДокументация</name>
    <type>
      <types>CatalogRef.РабочаяДокументация</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСогласованПТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказОтправленВОМТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиЗаказаВОМТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправилВОМТС</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеХарактеристикиНоменклатуры</name>
      <type>
        <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияЗаказа</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДляКорректировки</name>
      <type>
        <types>DocumentRef.ВнутреннийЗаказ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_закупками/src/Tasks/ЗадачиИсполнителейОМТС/Forms/ФормаЗадачиРаспределитьЗаказПоИсполнителям/Module.bsl
#Область ОбработчикиСобытийФормы

  &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	 	
	АвтоЗаголовок = Ложь;  
	РабочаяДокументация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВнутреннийЗаказ, "РабочаяДокументация");
	НаименованиеРабочейДокументации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочаяДокументация, "Наименование");	
	Заголовок = СтрШаблон("%1 (%2)",Объект.Наименование,НаименованиеРабочейДокументации); 

	Если Объект.Выполнена Тогда
		ЭтаФорма.ТолькоПросмотр = Истина; 
		Элементы.СотрудникОМТС.ТолькоПросмотр = Истина;
		ИнструкцияВыполненияЗадачи = "Задача выполнена";
	Иначе
		ИнструкцияВыполненияЗадачи = "Для выполнения задачи необходимо:
										|1. Назначить исполнителей для каждой номенклатуры заказа.
										|2. Если все устраивает, нажмите кнопку - Сохранить и закрыть.
										|3. Обратите внимание: Исполнители должны быть назначены по всем позициям.";

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьВнутреннийЗаказ(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", Объект.ВнутреннийЗаказ); 
	ОткрытьФорму("Документ.ВнутреннийЗаказ.Форма.ФормаДокумента",ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСотрудником(Команда)
	
	Сотрудник = Элементы.СотрудникОМТС;
	Если Не ЗначениеЗаполнено(СотрудникОМТС) Тогда
		
		ТекстСообщения = "Не заполнено поле Сотрудник ОМТС";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СотрудникОМТС");
	
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ВыбраннаяСтрока Из Элементы.СписокНоменклатуры.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.СписокНоменклатуры.ДанныеСтроки(ВыбраннаяСтрока);
		ДанныеСтроки.Исполнитель = СотрудникОМТС;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоИсполнителям(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		
		ТекстСообщения = "Заказ распределен не полностью.";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		Возврат; 
		
	КонецЕсли;
	
	Если Модифицированность Тогда  
		Если Не ЭтаФорма.Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	ДополнитьРегистрСведенийРаспределениеПоИсполнителямОМТС(); 
	
	СоздатьЗадачиСотрудникамДляПодтвержденияРаспределеннойНоменклатуры();
	ВыполнитьТекущуюЗадачуНаСервере();
	
	
	Оповестить("Запись_ЗадачиЗадачиИсполнителейОМТС");
	ЭтаФорма.Модифицированность = Ложь; 
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнитьТекущуюЗадачуНаСервере()
		
	ТекущаяЗадача = РеквизитФормыВЗначение("Объект");
	ТекущаяЗадача.ВыполнитьЗадачу();
	
КонецФункции

&НаСервере
Процедура ДополнитьРегистрСведенийРаспределениеПоИсполнителямОМТС()
	
	НаборЗаписей = РегистрыСведений.РаспределениеПоИсполнителямОМТС.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ВнутреннийЗаказ.Установить(Объект.ВнутреннийЗаказ); 
	НаборЗаписей.Прочитать();
	
	Для Каждого СтрокаТаблицы Из Объект.СписокНоменклатуры Цикл 
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Исполнитель)  Тогда 
			
			НоваяЗапись = НаборЗаписей.Добавить();	
			НоваяЗапись.Период = ТекущаяДатаСеанса();
			НоваяЗапись.ВнутреннийЗаказ = Объект.ВнутреннийЗаказ; 
			НоваяЗапись.Номенклатура = СтрокаТаблицы.Номенклатура;
			НоваяЗапись.ДополнительныеХарактеристикиНоменклатуры = СтрокаТаблицы.ДополнительныеХарактеристикиНоменклатуры;
			НоваяЗапись.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
			НоваяЗапись.СотрудникОМТС = СтрокаТаблицы.Исполнитель;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗадачиСотрудникамДляПодтвержденияРаспределеннойНоменклатуры()
	
	ТаблицаНоменклатуры = Объект.СписокНоменклатуры.Выгрузить();
	БизнесПроцессыИЗадачиСервер.СоздатьЗадачиСотрудникамДляПодтвержденияРаспределеннойНоменклатуры(Объект.ВнутреннийЗаказ, ТаблицаНоменклатуры);
		
КонецПроцедуры

#КонецОбласти
